<template>
  <div class="shenlun_test">
    <div class="test_head">
      <div class="logo_box">
        <img
          src="../../assets/images/logo.png"
          @click="goIndex()"
        >
      </div>
    </div>
    <div class="test_body">
      <div class="test_tit">
        2017年陕西公务员考试 《申论》真题试卷
      </div>
      <div class="test_data">
        <h2>给定材料：</h2>
        <div
          class="test_data_list"
          v-for="item in dataList"
        >
          <span>材料{{item.count}}：</span>
          <div v-for="list in item">
            <p v-for="tx in list">{{tx.tx}}</p>
          </div>
        </div>
      </div>
    </div>
    <div class="test_answer">
      <h2>答案及解析</h2>
      <div class="test_answer_list" v-for="item in ansList">
        <h2>第{{item.count}}题</h2>
        <p>{{item.tit}}</p>
        <div class="test_analysis">
          <span>答案：</span>
          <p>{{item.answer}}</p>
        </div>
        <div class="test_analysis">
          <span>解析：</span>
          <p>{{item.analysis}}</p>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      dataList: [
        {
          count: 1,
          text: [
            {
              tx:
                "2017年1月21日，西安市召开秦岭生态环境集中整治会议，西安市政府主要负责人提出，要加快制定秦岭保护工作问责规定，落实约谈制度，用刚性的制度管人、管事，用问责机制层层传导压力，倒逼各级干部主动担当、认真履职尽责，对失职渎职行为进行严肃问责，坚决保护好秦岭生态环境。（部分材料）"
            },
            {
              tx:
                "2017年1月21日，西安市召开秦岭生态环境集中整治会议，西安市政府主要负责人提出，要加快制定秦岭保护工作问责规定，落实约谈制度，用刚性的制度管人、管事，用问责机制层层传导压力，倒逼各级干部主动担当、认真履职尽责，对失职渎职行为进行严肃问责，坚决保护好秦岭生态环境。（部分材料）"
            },
            {
              tx:
                "2017年1月21日，西安市召开秦岭生态环境集中整治会议，西安市政府主要负责人提出，要加快制定秦岭保护工作问责规定，落实约谈制度，用刚性的制度管人、管事，用问责机制层层传导压力，倒逼各级干部主动担当、认真履职尽责，对失职渎职行为进行严肃问责，坚决保护好秦岭生态环境。（部分材料）"
            },
            {
              tx:
                "2017年1月21日，西安市召开秦岭生态环境集中整治会议，西安市政府主要负责人提出，要加快制定秦岭保护工作问责规定，落实约谈制度，用刚性的制度管人、管事，用问责机制层层传导压力，倒逼各级干部主动担当、认真履职尽责，对失职渎职行为进行严肃问责，坚决保护好秦岭生态环境。（部分材料）"
            }
          ]
        },
        {
          count: 2,
          text: [
            {
              tx:
                "2017年1月21日，西安市召开秦岭生态环境集中整治会议，西安市政府主要负责人提出，要加快制定秦岭保护工作问责规定，落实约谈制度，用刚性的制度管人、管事，用问责机制层层传导压力，倒逼各级干部主动担当、认真履职尽责，对失职渎职行为进行严肃问责，坚决保护好秦岭生态环境。（部分材料）"
            },
            {
              tx:
                "2017年1月21日，西安市召开秦岭生态环境集中整治会议，西安市政府主要负责人提出，要加快制定秦岭保护工作问责规定，落实约谈制度，用刚性的制度管人、管事，用问责机制层层传导压力，倒逼各级干部主动担当、认真履职尽责，对失职渎职行为进行严肃问责，坚决保护好秦岭生态环境。（部分材料）"
            },
            {
              tx:
                "2017年1月21日，西安市召开秦岭生态环境集中整治会议，西安市政府主要负责人提出，要加快制定秦岭保护工作问责规定，落实约谈制度，用刚性的制度管人、管事，用问责机制层层传导压力，倒逼各级干部主动担当、认真履职尽责，对失职渎职行为进行严肃问责，坚决保护好秦岭生态环境。（部分材料）"
            },
            {
              tx:
                "2017年1月21日，西安市召开秦岭生态环境集中整治会议，西安市政府主要负责人提出，要加快制定秦岭保护工作问责规定，落实约谈制度，用刚性的制度管人、管事，用问责机制层层传导压力，倒逼各级干部主动担当、认真履职尽责，对失职渎职行为进行严肃问责，坚决保护好秦岭生态环境。（部分材料）"
            }
          ]
        }
      ],
      ansList:[
        {
          count:'一',
          tit:'根据“给定资料1”谈谈你对“文化之美，是入世而独立”这句话的理解。',
          answer:'们付出了巨大的努力才看清楚我们所在的这颗蓝色星球的模样，才弄清楚我我们怎样进化成人，才变得有一点点的能力和空闲去利用、去支配自然获得片刻的闲暇以实现我们心中小小的偷懒的欲念。但现在的时刻，我们的文化、我们的民族、我们的国家，需要我们忙碌起来，而不是一直在缅怀过去、一直在不经过大脑地轻松娱乐。毕竟，在人类文明的长河里，我们总是历尽艰辛，万分努力，才让一切看起来不那么费劲。',
          analysis:'别让脑袋停止思考。人和人，甚至人和动物在肉体上都没多大的区别，差的就是灵魂。若不思索，甚至没有追求，随遇而安，你就必须接受所有后果，那就是被其他人或自然支配。'
        },
        {
          count:'二',
          tit:'2根据“给定资料1”谈谈你对“文化之美，是入世而独立”这句话的理解。',
          answer:'2们付出了巨大的努力才看清楚我们所在的这颗蓝色星球的模样，才弄清楚我我们怎样进化成人，才变得有一点点的能力和空闲去利用、去支配自然获得片刻的闲暇以实现我们心中小小的偷懒的欲念。但现在的时刻，我们的文化、我们的民族、我们的国家，需要我们忙碌起来，而不是一直在缅怀过去、一直在不经过大脑地轻松娱乐。毕竟，在人类文明的长河里，我们总是历尽艰辛，万分努力，才让一切看起来不那么费劲。',
          analysis:'2别让脑袋停止思考。人和人，甚至人和动物在肉体上都没多大的区别，差的就是灵魂。若不思索，甚至没有追求，随遇而安，你就必须接受所有后果，那就是被其他人或自然支配。'
        },
        {
          count:'三',
          tit:'3根据“给定资料1”谈谈你对“文化之美，是入世而独立”这句话的理解。',
          answer:'3们付出了巨大的努力才看清楚我们所在的这颗蓝色星球的模样，才弄清楚我我们怎样进化成人，才变得有一点点的能力和空闲去利用、去支配自然获得片刻的闲暇以实现我们心中小小的偷懒的欲念。但现在的时刻，我们的文化、我们的民族、我们的国家，需要我们忙碌起来，而不是一直在缅怀过去、一直在不经过大脑地轻松娱乐。毕竟，在人类文明的长河里，我们总是历尽艰辛，万分努力，才让一切看起来不那么费劲。',
          analysis:'3别让脑袋停止思考。人和人，甚至人和动物在肉体上都没多大的区别，差的就是灵魂。若不思索，甚至没有追求，随遇而安，你就必须接受所有后果，那就是被其他人或自然支配。'
        }
      ]
    };
  },
  methods:{
    goIndex(){
      window.location.href = '/';
    }
  }
};
</script>

<style>
.test_head {
  width: 100%;
  height: 60px;
  border-bottom: 1px solid #cbcbcb;
}
.logo_box {
  width: 1190px;
  margin-left: 20%;
}
.logo_box img {
  width: 140px;
  cursor: pointer;
}
.test_body {
  width: 60%;
  margin: auto;
  margin-top: 20px;
}
.test_tit {
  font-size: 16px;
  color: #333;
}
.test_data h2 {
  font-size: 14px;
}
.test_data_list {
  font-size: 14px;
}
.test_data_list p {
  line-height: 26px;
  text-indent: 2em;
}
.test_answer {
  width: 60%;
  margin: auto;
  font-size: 14px;
}
.test_answer h2 {
  font-size: 14px;
}
.test_answer span {
  font-weight: bold;
}
.test_analysis p{
  color: #666;
  line-height: 24px;
}
</style>
